buoyantCavity_IAWPS/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType  IAPWSThermo;
// {
//     type            IAPWSThermo;//heRhoThermo;
//     mixture         pureMixture;
//     transport       const;
//     thermo          hConst;
//     equationOfState perfectGas;
//     specie          specie;
//     energy          sensibleEnthalpy;
// }

// mixture
// {
//     specie
//     {
//         molWeight       28.96;
//     }
//     thermodynamics
//     {
//         Cp              1004.4;
//         Hf              0;
//     }
//     transport
//     {
//         mu              1.831e-05;
//         Pr              0.705;
//     }
// }


// ************************************************************************* //
